In [1]:
import pandas as pd
import numpy as np

In [2]:
def check_int(value):
    try:
        int(value)
        return np.NaN
    except ValueError:
        return value

In [3]:
df = pd.read_excel(r'KPMG.xlsx' ,
                   sheet_name='CustomerAddress',
                  )
print(df)

      customer_id                    address  postcode            state  \
0               1         060 Morning Avenue      2016  New South Wales
1               2        6 Meadow Vale Court      2153  New South Wales
2               4         0 Holy Cross Court      4211              QLD
3               5        17979 Del Mar Point      2448  New South Wales
4               6           9 Oakridge Court      3216              VIC
...           ...                        ...       ...              ...
3994         3999            1482 Hauk Trail      3064              VIC
3995         4000  57042 Village Green Point      4511              QLD
3996         4001     87 Crescent Oaks Alley      2756              NSW
3997         4002           8194 Lien Street      4032              QLD
3998         4003            320 Acker Drive      2251              NSW

        country  property_valuation
0     Australia                  10
1     Australia                  10
2     Australia                   9
3     Australia                   4
4     Australia                   9
...         ...                 ...
3994  Australia                   3
3995  Australia                   6
3996  Australia                  10
3997  Australia                   7
3998  Australia                   7

[3999 rows x 6 columns]

In [4]:
df.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [5]:
df.describe()

       customer_id     postcode  property_valuation
count  3999.000000  3999.000000         3999.000000
mean   2003.987997  2985.755939            7.514379
std    1154.576912   844.878364            2.824663
min       1.000000  2000.000000            1.000000
25%    1004.500000  2200.000000            6.000000
50%    2004.000000  2768.000000            8.000000
75%    3003.500000  3750.000000           10.000000
max    4003.000000  4883.000000           12.000000

In [6]:
df1 = df.convert_dtypes()
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   Int64
 1   address             3999 non-null   string
 2   postcode            3999 non-null   Int64
 3   state               3999 non-null   string
 4   country             3999 non-null   string
 5   property_valuation  3999 non-null   Int64
dtypes: Int64(3), string(3)
memory usage: 199.3 KB

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [8]:
nan_count = df1.isna().sum() 
print("Missing Values")
print(nan_count)

Missing Values
customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [9]:
na_count = 0
for column in df1:
    print(df[column].isna().sum(),"Missing values on ", column)
    na_count = na_count + df[column].isna().sum()
    
#newdf = df.dropna() if necessary
print(na_count,"Missing values")

0 Missing values on  customer_id
0 Missing values on  address
0 Missing values on  postcode
0 Missing values on  state
0 Missing values on  country
0 Missing values on  property_valuation
0 Missing values

In [10]:
Na_Percentage = df1.isna().sum().sum() / df.size * 100
Completeness = 100 - Na_Percentage
print ("The Completeness of the data is ", Completeness , "%" )

The Completeness of the data is  100.0 %

In [11]:
#df1['DOB'] = pd.to_datetime(df1['DOB'])

In [12]:
#Tests
print("There is", df.duplicated().sum(), "duplicated rows")
#df.drop_duplicates(inplace = True) inplace(remove from original DataFrame)

There is 0 duplicated rows

In [13]:
print("Unique Values")
for column in df1:
    print(column)
    print(pd.unique(df1[column]))

Unique Values
customer_id
<IntegerArray>
[   1,    2,    4,    5,    6,    7,    8,    9,   11,   12,
 ...
 3994, 3995, 3996, 3997, 3998, 3999, 4000, 4001, 4002, 4003]
Length: 3999, dtype: Int64
address
<StringArray>
[       '060 Morning Avenue',       '6 Meadow Vale Court',
        '0 Holy Cross Court',       '17979 Del Mar Point',
          '9 Oakridge Court',          '4 Delaware Trail',
       '49 Londonderry Lane',           '97736 7th Trail',
      '93405 Ludington Park',   '44339 Golden Leaf Alley',
 ...
    '2918 Summer Ridge Hill',             '613 Erie Lane',
        '0 Transport Center',       '4 Dovetail Crossing',
      '736 Roxbury Junction',           '1482 Hauk Trail',
 '57042 Village Green Point',    '87 Crescent Oaks Alley',
          '8194 Lien Street',           '320 Acker Drive']
Length: 3996, dtype: string
postcode
<IntegerArray>
[2016, 2153, 4211, 2448, 3216, 2210, 2650, 2023, 3044, 4557,
 ...
 3104, 3860, 2658, 3052, 4163, 2590, 2550, 2877, 4311, 3089]
Length: 873, dtype: Int64
state
<StringArray>
['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria']
Length: 5, dtype: string
country
<StringArray>
['Australia']
Length: 1, dtype: string
property_valuation
<IntegerArray>
[10, 9, 4, 12, 8, 6, 7, 3, 5, 11, 1, 2]
Length: 12, dtype: Int64